Repository: 84000/data-translation-memory
Catalog: toh218-v1.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དེའི་ཕྱིར་ཆོས་འདི་དག་ནི་ཇི་སྐད་བསྟན་པ་དེ་ཁོ་ན་བཞིན་ཏེ།
en: Monk, for these reasons, these phenomena are exactly as I have taught.

source: དགེ་སློང་ང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པས་ནི་ཆོས་གང་གིས་སྐྱེ་བའམ། འཇིག་པའམ། ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བའམ། སྒྲིབ་པའམ། ཀུན་ནས་དཀྲིས་པའམ། འགྱོད་པའམ། ཡིད་ལ་གཅགས་པའི་ཆོས་རྡུལ་ཙམ་ཡང་མི་དམིགས་སོ། །
en: Monk, dwelling within the essence of enlightenment, I have not perceived even the slightest phenomenon that arises, that perishes, that is afflicted, cleansed, obscured, fettered, regretful, or miserable.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགེ་སློང་ཆོས་ཐམས་ཅད་ནི་རྟག་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པས་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ཕྱིར་རོ། །
en: Why is that so? Monk, as all phenomena are at all times unafflicted, they are perfectly pure by nature.”

source: དེ་ནས་དགེ་སློང་དྲི་མེད་འོད་ཀྱིས་ཆོས་ཀྱི་རང་བཞིན་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: When the monk Stainless Light heard this of the nature of phenomena, he felt satisfied, and rejoiced.

source: རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: He was very happy, and felt joy and relief.

source: སྒྲིབ་པ་མེད་པར་ཤིན་ཏུ་དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Delighted to have no obscurations, he joined his palms before the Bhagavān, bowed, and spoke these verses to the Bhagavān:

source: ཀྱེ་མ་ཀྱེ་མ་སངས་རྒྱས་མཐུ་ཆེ་བ། །
en: “Ah! Ah! Buddha powerful,

source: ལྷར་བཅས་འཇིག་རྟེན་སྐྱབས་ནི་ཁྱོད་ལགས་ཏེ། །
en: Refuge of the world including gods,

source: མ་བསླབས་བཞིན་དུ་ཡོན་ཏན་ཀུན་གྱིས་འཕགས། །
en: Even though you needed no training, Your good qualities rise above all.

source: སྡུག་བསྔལ་ཀུན་འགྲེལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to you, who sets free all pain!

source: སྐྱབས་མ་མཆིས་པ་རྣམས་ཀྱི་སྐྱབས་ཁྱོད་མཛོད། །
en: “You grant refuge to the protectorless,

source: འདྲེན་པ་མ་མཆིས་རྣམས་ཀྱི་འདྲེན་ཁྱོད་མཛོད། །
en: And give counsel to those without guide.

source: ཞིར་གྱུར་བདེ་བའི་ལམ་ལ་གནས་པ་པོ།
en: You dwell in the peaceful path of bliss.

source: སངས་རྒྱས་མཐུ་ཆེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, Buddha powerful!

source: ཁྱོད་ནི་འཇིག་རྟེན་ལོང་བའི་སྒྲོན་མ་ལགས། །
en: “You are the lamp for the blind of this world;

source: མིག་མ་མཆིས་པ་རྣམས་ལ་མིག་སྩོལ་ཁྱོད། །སེམས་ཅན་མ་གྲོལ་རབ་ཏུ་གྲོལ་མཛད་ཁྱོད། །
en: Granting sight to those who could not see, You free those beings who had no freedom.

source: དཔའ་བོ་མཐུ་ཆེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, hero powerful!

source: ཆགས་དང་སྡང་ལ་ཁྱོད་ནི་ཆགས་མི་མངའ། །སྲེད་ལ་ཆགས་རྣམས་སྡུག་བསྔལ་འགྲེལ་པ་ཁྱོད། །འཁོར་བའི་འཁོར་ལོ་མི་བདེན་ཐུགས་སུ་ཆུད། །
en: “You are free from clinging and dislike, And teach lustful ones suffering; You have seen the lie of saṃsāra’s circle.

source: ཡེ་ཤེས་སྟོབས་འཕགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, wisdom’s might supreme!

source: རྟོག་དང་རྣམ་རྟོག་རྣམས་ཀྱིས་རྟག་མི་ཆགས། །
en: “Never attached because of discursive thoughts,

source: ཡེ་ཤེས་བསམ་མི་ཁྱབ་པས་གྲོལ་བ་པོ། །འཇིག་རྟེན་གསུམ་མཆོག་དྲི་མེད་ཉོན་མོངས་གྲོལ། །
en: Freeing with inconceivable wisdom, Supreme in the three worlds,

source: དྲི་མེད་དག་པའི་སེམས་ཅན་ཁྱོད་ཕྱག་འཚལ། །
en: Homage to you, who are unstained and clean!

source: བྱང་ཆུབ་ལ་ནི་བདག་ཀྱང་ཞུགས་བགྱིས་ལ། །སེམས་ཅན་སྡུག་བསྔལ་སྐྱབས་མ་མཆིས་རྣམས་དགྲོལ།
en: “I, too, shall enter awakening, Shall end helpless beings’ misery.

source: འདི་འདྲའི་ཡེ་ཤེས་བདག་གིས་ཐོབ་གྱུར་ཅིང་། །ཐེག་པ་དམན་པས་ཟག་པ་བས་མ་གྱུར། །
en: Having attained such wisdom I shall not be tainted by the lesser paths.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་ཡས་ཀྱིས། །སྡུག་བསྔལ་བས་བགྱི་བྱང་ཆུབ་ཡོང་མི་སྤོང་། །
en: “I shall suffer for inconceivable myriads of eons, But shall not forsake the bodhi mind.

source: སྐར་མའི་ཚོགས་ཀྱི་ནང་ན་དགུང་ཟླ་ལྟར། །འཇིག་རྟེན་མགོན་པོ་བདག་གིས་དེ་འདྲར་མཐོང་།
en: Like the moon within a field of stars Is how you appear, world’s guardian.

source: ཇི་ལྟར་བསམ་པ་དམན་པའི་མི་འགའ་ཞིག །
en: “Some with inferior minds,

source: རྒྱ་མཚོ་ཆེན་པོའི་ནང་དུ་ཕྱིན་གྱུར་ཀྱང་། །
en: Though they travel on the vast extensive sea,

source: རིན་ཆེན་མང་པོ་མི་ལེན་སྤོང་བགྱིད་ཅིང་། །
en: Fail to collect many gems,

source: མཆིང་བུའི་ནོར་བུ་བླངས་ནས་མཆི་བར་བགྱིད།
en: But only bring back worthless trinkets.

source: དེ་བཞིན་གང་དག་སངས་རྒྱས་རྣམ་འཕྲུལ་སྟོབས། །ཐོས་ཀྱང་འདིར་ནི་བྱང་ཆུབ་སེམས་མི་སྐྱེད། །
en: “Likewise, in some, although they hear of the buddhas’ manifestations And his strengths, awakened intent does not arise.

source: བྱང་ཆུབ་སྤངས་ནས་ཉན་ཐོས་འཚལ་བ་གང་། །
en: They turn away from awakening, and strive on the hearers’ path.

source: དེ་དག་ཡེ་ཤེས་ཡངས་ལ་འཇུག་མི་འགྱུར། །
en: They will not pierce wisdom’s vast expanse—

source: འདིར་ནི་མི་ཞིག་བྱིས་པའི་རང་བཞིན་ཅན། །
en: just as someone with childish character,

source: རྒྱལ་པོ་འབངས་ཀྱིས་བསྐོར་བ་མཐོང་གྱུར་ཀྱང་། །
en: Although they see the king surrounded by his court,

source: དེ་ནི་བློན་པོའི་ཐབས་ལ་སེམས་བསྐྱེད་ན། །དེ་ཡི་ཤེས་པ་ཡངས་པར་མི་འཇུག་ལྟར། །
en: Finds inspiration only in the ministers’ skill And will not fully pierce the knowledge of the king.

source: དེ་ལྟར་སངས་རྒྱས་ཡོན་ཏན་ཆེ་ཉིད་དང་། །ཡེ་ཤེས་རྣམ་པར་འཕྲུལ་པ་ཐོས་གྱུར་ཀྱང་། །ཤེས་པ་དམན་པ་ལ་ནི་འདུན་སྐྱེད་པ། །
en: “Likewise, there are those who, Although they hear of great buddha attributes, And of his wisdom’s magical display, Decide upon the lower mind.

source: དེ་ནི་ལེ་ལོ་ཅན་ཏེ་སེམས་ཀྱང་ཞུམ། །
en: They are lazy and their minds are weak.

source: ཐེག་པ་དམན་པས་འཇིག་རྟེན་མ་ཆགས་པ། །མཚན་མོ་སྲིན་བུ་མེ་ཁྱེར་སྣང་བ་འདྲ།
en: “The nonattachment to the world of those of the inferior vehicle Gives as much light as fireflies in the night.

source: ཉི་མའི་གཟི་བརྗིད་ཀྱིས་ནི་ལས་བགྱིད་པ། །སྣང་བ་ཐོབ་ནས་མུན་དང་བྲལ་བར་འགྱུར། །
en: But those who work with the sun in all its splendor, Will, when they obtain that illumination, be divest of darkness.

source: སངས་རྒྱས་སྒྲས་ནི་མཐོ་རིས་མཆི་བར་འགྱུར། །
en: “The Buddha’s voice reaches the highest realms.

source: སངས་རྒྱས་སྒྲས་ནི་བཟང་འགྲོར་མཆི་བར་འགྱུར། །
en: The Buddha’s voice reaches the noble-born.

source: འཇིག་རྟེན་འདི་ན་སངས་རྒྱས་སྒྲོན་མའི་མཆོག
en: The Buddha, supreme lamp for this world,

source: ལྷར་བཅས་འཇིག་རྟེན་འདི་ནི་སྣང་བར་མཛད། །
en: Illuminates all the world and the realms of the gods.

source: ཝ་ཡི་ཁྲོད་ན་སེང་གེ་མཐོང་གྱུར་ན། །
en: “Just as, when a lion is seen among foxes,

source: ཝ་ཡི་སྐད་ལ་འདུན་པ་སྐྱེད་པ་དང་། །
en: Some may take interest in fox talk And,

source: སེང་གེ་རྣམ་པར་འཕྲུལ་བ་སྤོང་བགྱིད་ཅིང་། །ཝ་ཡི་ཆོས་ཀྱི་དགའ་བ་སྐྱེད་པ་ལྟར། །
en: ignoring the lion’s display, Find delight in fox affairs,

source: དེ་བཞིན་གང་དག་ཉན་ཐོས་ཁྲོད་དག་ཏུ། །སྐྱེས་བུ་ཁྱུ་མཆོག་སེང་གེ་རྣམ་འཕྲུལ་མཐོང་། །
en: “So too, when those who, among the hearers, See the Supreme Lion of Man’s display,

source: ཐེག་པ་དམན་ལ་དགའ་བ་སྐྱེད་པ་ནི། །དེ་དག་ཕྱོགས་གཅིག་པ་ཡི་རྫུ་འཕྲུལ་ལགས། །
en: But take delight in the lower vehicle, Their powers will be one-sided indeed.

source: ཡེ་ཤེས་འཚལ་བའི་མིས་ནི་དུས་ཀུན་ཏུ། །འཇིག་རྟེན་ཀུན་ཏུ་སྡུག་བསྔལ་མང་འགྲེལ་བ། །ཉན་ཐོས་མང་པོའི་ས་མིན་གང་ལགས་པ། །ཡེ་ཤེས་དམ་པ་མཆོག་ནི་བཙལ་བར་བགྱི།
en: “May people who seek wisdom always expound On suffering, to help the worldly ones; May they seek the wisdom, true and sublime, That is not the ground of common hearers.”

source: དེ་ནས་དགེ་སློང་དྲི་མེད་འོད་ཀྱི་ཚིགས་སུ་བཅད་པ་སྤོབས་པ་སྨྲས་པ་འདི་ཐོས་ནས། །
en: Hearing these verses of faith spoken by the monk Stainless Light,

source: ལྷའི་བུ་བཞི་ཁྲི་ཉིས་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: forty-two thousand sons of gods gave rise to the mind set on unsurpassed, perfectly complete enlightenment.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དགེ་སློང་དྲི་མེད་འོད་ལ་མེ་ཏོག་མན་དཱ་ར་བ་དག་གིས་གཏོར་ཏེ།
en: Tossing mandārava blossoms toward the Bhagavān, Youthful Mañjuśrī, and the monk Stainless Light,

source: ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ། །དགེ་སློང་ལེགས་སོ་ལེགས་སོ། །
en: they proclaimed, “Monk, very good, very good.

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་རྗེས་སུ་འཛིན་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་གཟོ་བ་ཉིད་ཡིན་ནོ། །
en: To thus pursue the enlightenment of a buddha is to reciprocate the Tathāgata’s kindness.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །
en: At that moment the Bhagavān smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ། ནམ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་འཕྲོ་བ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་ཁ་དོག་དུ་མ་དང་།
en: An attribute of bhagavān buddhas is that whenever they smile, light radiates from their mouths in myriad colors such as blue, yellow, red, white, vermillion, crystalline, and silver.

source: ཁ་དོག་སྣ་ཚོགས་བྱུང་སྟེ། དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ནས། ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་སྟེ།
en: Diverse colors emerged, permeated infinite limitless world systems with light, and extended up to the brahmā worlds.

source: ཉི་མ་དང་ཟླ་བའི་འོད་ཀྱང་མོག་མོག་པོར་བྱས་ནས་ཕྱིར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: Outshining even the light of the sun and moon, the light then returned, circled around the Bhagavān three times, and vanished into the crown of the Bhagavān’s head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the venerable Ānanda rose from his seat. Draping his Dharma robe over one shoulder, he placed his right knee on the ground, faced the Bhagavān, joined his palms, and asked him,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན།
en: “As the bhagavats, tathāgatas, arhats, perfectly enlightened buddhas do not smile without causes and conditions,

source: འཛུམ་པ་མཛད་པའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: what is the cause of your smile, and what are the conditions for it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དགེ་སློང་དྲི་མེད་འོད་འདིས་ལྷག་པའི་བསམ་པ་དེ་ལྟ་བུས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། །
en: “Ānanda,” replied the Bhagavān, “the monk Stainless Light has given rise to the mind set on enlightenment with noble intent.

source: དེའི་ཕྱིར་ངས་དགེ་སློང་དྲི་མེད་འོད་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བྱ་སྟེ།
en: I therefore predict that the monk Stainless Light will attain unsurpassed, perfectly complete enlightenment.

source: ཀུན་དགའ་བོ་དགེ་སློང་དྲི་མེད་འོད་འདི་ནི་མ་འོངས་པའི་དུས་བསྐལ་པ་བཅུ་འདས་པ་ན་སངས་རྒྱས་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་ལ་མཆོད་པ་བྱེད་པར་འགྱུར་ཏེ།
en: Ānanda, in the future, after ten eons have passed, the monk Stainless Light will make offerings to two hundred and twenty million buddhas and

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱམས་པ་ལས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ།
en: attain patient forbearance in seeing all phenomena as nonarising, in the presence of the tathāgata, arhat, perfectly complete Buddha Maitreya.

source: བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་ཡང་མཆོད་པ་བྱེད་པར་འགྱུར་ཏེ།
en: He will also make offerings to all the bhagavān buddhas of the Fortunate Eon.

source: དེའི་འོག་ཏུ་མངོན་པར་བྱུང་ནས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་པད་མ་རྣམ་པར་གྲགས་སྤྱོད་སེང་གེའི་སྒྲ་སྒྲོགས་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: Thereafter, having fully matured, he will become the Tathāgata He Who Proclaims the Lion’s Roar of Conduct That Is Renowned to Be the Lotus of Good Qualities.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་པད་མ་རྣམ་པར་གྲགས་སྤྱོད་སེང་གེའི་སྒྲ་སྒྲོགས་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་
en: Ānanda, the buddhafield of that tathāgata, arhat, perfectly complete buddha, He Who Proclaims the Lion’s Roar of Conduct That Is Renowned to Be the Lotus of Good Qualities,

source: རིན་པོ་ཆེ་སྣ་བདུན་ལས་གྲུབ་པར་འགྱུར་ལ། །
en: will be made with seven precious attributes.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་མེད་དེ། བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་འདུ་བར་འགྱུར་རོ།
en: There will be no hearers or solitary realizers, only bodhisattvas will gather there.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཡང་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ཞེས་བྱ་བའི་ཆོས་བསྟན་པར་འགྱུར་རོ།
en: Furthermore, in this buddhafield he will teach them the Dharma called ‘The Wheel of No Return.’

source: དེ་དག་ཀྱང་མྱུར་བ་ཉིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། །
en: Also, those bodhisattvas will swiftly awaken truly and completely into unsurpassed, perfectly complete enlightenment.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡེ་ཤེས་ཀྱི་ཁྱད་པར་གྱིས་ཡོངས་སུ་སྦྱང་བར་འགྱུར་རོ།
en: Thus their buddhafield will become utterly purified by the excellence of exalted wisdom,

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་རྣམ་གྲགས་མཐའ་ཡས་ལྡན་ཞེས་བྱ་བར་འགྱུར་རོ།
en: and this world system will then be called Endowed with Infinite Discourses.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: The Bhagavān then said to the venerable Ānanda,

source: ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ་དཔེར་ན་ཉི་མ་ཤར་བ་ན་མུན་པ་ཐམས་ཅད་མེད་པར་འགྱུར་རོ།
en: “Ānanda, it is like this. In the same way that all darkness disappears when the sun rises,

source: ཀུན་དགའ་བོ་དེ་བཞིན་དུ་གང་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པ་དེ་དག་གིས་ཀུན་ནས་སྣང་བ་ཐོབ་པར་འགྱུར་ཏེ།
en: Ānanda, so, likewise, whoever hears this Dharma discourse will attain full illumination,

source: ཆོས་ཐམས་ཅད་ལ་ཡང་སྒྲིབ་པ་མེད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: and will also attain nonobscuration with regard to all phenomena.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At this, the venerable Ānanda asked the Bhagavān,

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་སྒྲིབ་པ་དང་། སྒྲིབ་པ་མ་མཆིས་པར་འགྱུར་བ་ལགས།
en: “Bhagavān, how does one become obscured, and how nonobscured?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཐོང་ཤིག་གནས་འདི་འདྲི་བས་ཁྱོད་ལ་ཅི་ཞིག་བྱ། །
en: But the Bhagavān told him, “Never mind, Ānanda! What use is it for you to ask questions on that point?

source: ཀུན་དགའ་བོ་གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་སྒྲིབ་པ་དང་སྒྲིབ་པ་མེད་པ་ཐམས་ཅད་བཤད་དུ་ཟིན་ན་ལྷར་བཅས་པའི་འཇིག་རྟེན་རྨོངས་པར་འགྱུར་རོ། །
en: Ānanda, if the tathāgata explained everything about obscuration and nonobscuration, the world and its gods would become confused.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Youthful Mañjuśrī, however, made this plea to the Bhagavān:

source: བཅོམ་ལྡན་འདས་སྒྲིབ་པ་དང་། སྒྲིབ་པ་མ་མཆིས་པ་གང་ཐོས་ན།
en: “Bhagavān, by hearing about obscuration and nonobscuration,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་བབ་པའི་ཚེ། འཇིག་རྟེན་པའི་ཆོས་རྣམས་ལ་འདོད་པ་སྐྱེད་པ་མི་འགྱུར་བར་དེ་བཤད་དུ་གསོལ།
en: the bodhisattvas of the final five hundred years will no longer give rise to desire for worldly affairs. Therefore, please do explain them!”

source: འཇམ་དཔལ་སྒྲིབ་པ་ཞེས་བྱ་བ་ལ་འདོད་ཆགས་ནི་སྒྲིབ་པའོ།
en: “Mañjuśrī, as for ‘obscuration,’ attachment is an obscuration,

source: ཞེ་སྡང་ནི་སྒྲིབ་པའོ།
en: hatred is an obscuration,

source: གཏི་མུག་ནི་སྒྲིབ་པའོ། །
en: ignorance is an obscuration,

source: སྦྱིན་པ་ནི་སྒྲིབ་པའོ། །
en: generosity is an obscuration,

source: ཚུལ་ཁྲིམས་ནི་སྒྲིབ་པའོ། །
en: moral conduct is an obscuration,

source: བཟོད་པ་ནི་སྒྲིབ་པའོ། །
en: patience is an obscuration,

source: བརྩོན་འགྲུས་ནི་སྒྲིབ་པའོ། །
en: diligence is an obscuration,

source: བསམ་གཏན་ནི་སྒྲིབ་པའོ། །
en: meditation is an obscuration,

source: ཤེས་རབ་ནི་སྒྲིབ་པའོ། །
en: transcendent awareness is an obscuration,

source: སངས་རྒྱས་སུ་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving the Buddha is an obscuration,

source: ཆོས་སུ་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving the Dharma is an obscuration,

source: དགེ་འདུན་དུ་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving the Saṅgha is an obscuration,

source: སྟོང་པ་ཉིད་དུ་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving emptiness is an obscuration,

source: མཚན་མ་མེད་པར་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving signlessness is an obscuration,

source: སྨོན་པ་མེད་པར་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving wishlessness is an obscuration,

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པར་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving the actual absence of formations is an obscuration,

source: སྐྱེ་བ་མེད་པར་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: perceiving nonarising is an obscuration,

source: བྱང་ཆུབ་ཏུ་འདུ་ཤེས་པ་ནི་སྒྲིབ་པའོ། །
en: and perceiving enlightenment is an obscuration.

source: འཇམ་དཔལ་མདོར་ན་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བར་དམིགས་པ་དེ་དག་ཐམས་ཅད་ནི་དེའི་སྒྲིབ་པ་ཡིན་པར་བལྟ་བར་བྱའོ། །
en: Mañjuśrī, in brief, whether they are viewed as totally afflicted or fully cleansed, you should regard them all as obscurations.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། །
en: Mañjuśrī asked,

source: བཅོམ་ལྡན་འདས་སྦྱིན་པ་ཇི་ལྟར་སྒྲིབ་པ་ལགས། །
en: “Bhagavān, how is generosity an obscuration?

source: ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཇི་ལྟར་སྒྲིབ་པ་ལགས།
en: How are moral conduct, patience, diligence, meditation, and transcendent awareness obscurations?”

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ལ་ནི་སྒྲིབ་པ་མེད་མོད་ཀྱི།
en: “Mañjuśrī,” replied the Bhagavān, “in all phenomena there is indeed no obscuration.

source: འོན་ཀྱང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་རང་གི་རྟོག་པས་སྦྱིན་པ་ཡང་སྒྲིབ་པའི་བྱ་བ་བྱེད་དོ། །
en: Nevertheless, conditioned by their thoughts, childish ordinary beings engage in obscured activity with regard to generosity,

source: ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱང་སྒྲིབ་པའི་བྱ་བ་བྱེད་དོ། །
en: and they engage in obscured activity with regard to moral conduct, patience, diligence, meditation, and transcendent awareness.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: How is this so?

source: འཇམ་དཔལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་སྦྱིན་པ་སྦྱིན་པ་ན། སེམས་ཅན་སེར་སྣ་ཅན་རྣམས་ལ་མ་དད་པར་བྱེད་དེ།
en: “Mañjuśrī, when childish ordinary beings practice generosity, they do it with disrespect toward miserly sentient beings.

source: དེ་དག་མ་དད་པ་དེས་ཁོང་ཁྲོ་བ་དང་། ཐ་བའི་ཉེས་པ་སྐྱེད་པར་བྱེད་དོ།
en: Due to their disrespect, those who practice giving get angry and give rise to the fault of resentfulness.

source: ཁོང་ཁྲོ་བ་དང་། ཐ་བའི་ཉེས་པས་སེམས་ཅན་དམྱལ་བར་ལྟུང་བར་འགྱུར་རོ།
en: The faults of anger and resentfulness plunge them into the hell realms.

source: དེ་དག་ཚུལ་ཁྲིམས་སྲུང་བ་ན་ཚུལ་ཁྲིམས་འཆལ་པ་ལ་སྨོད་ཅིད་བརྙས་པར་བྱེད་ལ་བསྔགས་པ་མ་ཡིན་པ་རྗོད་དོ། །
en: “When childish ordinary beings observe moral conduct they speak ill of those neglecting moral conduct, disparaging and treating them contemptuously.

source: དེ་དག་ལས་དེ་དག་གི་བསྔགས་པ་མ་ཡིན་པ་ཐོས་པས་སོ་སོའི་སྐྱེ་བོ་མང་པོ་དག་མ་དད་པར་བྱེད་དེ། །
en: When these disparaging remarks are repeated to others it causes disrespect in many ordinary beings,

source: དེ་དག་མ་དད་པ་དེས་ངན་འགྲོར་འགྲོ་བར་འགྱུར་རོ། །
en: who will go to the lower realms due to their disrespect.

source: དེ་དག་བཟོད་པ་སྒོམ་པ་ན་བདག་ཅག་ནི་བཟོད་པར་སྨྲ་བ་ཡིན་གྱི་གཞན་འདི་དག་ནི་གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པ་ཡིན་ནོ་ཞེས་བཟོད་པའི་རྒྱགས་པས་
en: “When they practice patience, they declare, ‘We have patience, while those others bear harmful thoughts.’

source: མྱོས་པ་དེ་དག་བག་མེད་པའི་གཞི་ལས་བྱུང་བའི་སྡུག་བསྔལ་རྣམས་སྐྱེད་པར་འགྱུར་རོ། །
en: Intoxicated with the arrogance of patience, they create all the suffering that results from fundamental heedlessness.

source: དེ་དག་བརྩོན་འགྲུས་རྩོམ་པ་ན་བདག་སྒྲོགས་ཤིང་དགེ་སློང་འདི་དག་ནི་ལེ་ལོ་ཅན་དུ་གནས་པ་ཡིན་ཏེ། བརྩོན་པ་མེད་པར་དད་པས་བྱིན་པ་ལོངས་སྤྱོད་པར་བྱེད་དོ། །དེ་དག་གིས་ནི་ཆུ་རའི་ཆུ་ཡང་ལོངས་སྤྱོད་པར་མི་འོས་སོ་སྙམ་སྟེ།
en: “When they exert themselves in diligence, they extol themselves and think, ‘Those other monks are lazy and lack diligence, yet they enjoy the offerings of the faithful. They are not worthy of even enjoying water from a water container.’

source: དེ་དག་བརྩོན་འགྲུས་རྩོམ་པས་བདག་ལ་ནི་སྟོད་པར་བྱེད། གཞན་ལ་ནི་སྨོད་པར་བྱེད་དེ། །
en: As they exert themselves in diligence, they praise themselves and disparage others.

source: དེ་དག་ནི་བྱིས་པ་ཡིན་ཞེས་ང་སྨྲའོ། །
en: I say that they are childish beings.

source: དེ་དག་བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པ་ན།
en: “When they spend their time in the equilibrium of meditation,

source: བསམ་གཏན་གྱི་དགའ་བ་དེ་ལ་ཆགས་པ་སྐྱེད་པར་བྱེད་ཅིང་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: they give rise to attachment to the joyful bliss of meditation and think,

source: བདག་ཅག་ནི་མཉམ་པར་བཞག་པས་གནས་པ་ཡིན་གྱི།
en: ‘We spend our time in equipoise.

source: དགེ་སློང་གཞན་འདི་དག་ནི་སེམས་གཡེངས་པས་གནས་པ་ཡིན་ཏེ།
en: Those other monks spend their time in mental distraction.

source: འདུ་འཛི་ལ་དགའ་བས་གནས་པ་ཡིན་ནོ། །
en: They spend their time enjoying frivolous entertainments.

source: འདུ་འཛི་ལ་དགའ་བས་འདི་དག་སངས་རྒྱས་སུ་ག་ལ་འགྱུར་ཏེ།
en: As they enjoy frivolous entertainments, how will they ever become buddhas?

source: འདི་དག་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་རིང་ངོ་
en: They are far from the enlightenment of a buddha.’

source: དེ་དག་འདུ་ཤེས་ཡིད་ལ་བྱེད་པ་དེས་ཇི་ཙམ་དུ་བརྙས་པར་གྱུར་པའི་སེམས་སྐྱེད་པར་བྱེད་པ་དེ་སྙེད་ཀྱི་བསྐལ་པར་འཁོར་བ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །
en: Those who take attitudes like these, as long as they think such contemptuous thoughts, will cling tightly to saṃsāra for eons.

source: ཕྱིས་དེ་དག་གིས་གང་དུ་བྱང་ཆུབ་ལ་སྤྱོད་པ་ན་གལ་ཏེ་དེ་དག་མང་དུ་ཐོས་པ་ཡིན་དུ་ཟིན་ཀྱང་དེ་དག་གིས་ཆོས་ཐམས་ཅད་ཡི་གེ་མེད་པ་ལ་རྣམ་པར་ཤེས་པ་ཡོད་པར་བརྟགས་ཏེ།
en: Later, if they engage in enlightenment, even if they have great learning, they will imagine that, among all letterless phenomena, the mind is existent.

source: ཤེས་རབ་ཏུ་དམིགས་ནས་ཕ་རོལ་ཁྱད་དུ་གསོད་པར་བྱེད་པ་དེ་དག་ནི་མི་ཤེས་པའོ་ཞེས་ང་སྨྲའོ།
en: “When they observe transcendent awareness they disdain others. I say that they have no knowledge,

source: མི་ཤེས་བཞིན་དུ་སྨྲའོ་ཞེས་ང་སྨྲའོ།
en: I say that they talk even though they do not know;

source: སྐྱེས་བུ་དམ་པ་མ་ཡིན་པའོ་ཞེས་ང་སྨྲའོ། །རྣམ་པར་རྟོག་པས་ཉམས་པའོ་ཞེས་ང་སྨྲའོ། །
en: I say that they are not sublime beings; I say that as they conceptualize, they are corrupted.

source: གལ་ཏེ་དེ་དག་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པར་གྱུར་ན་ཡང་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “If they enter the Mahāyāna, again they will think,

source: བདག་ཅག་ནི་འཇིག་རྟེན་ན་གཙོ་བོ་ཡིན་ནོ། །
en: ‘We are foremost in this world,

source: བདག་ཅག་ནི་འཇིག་རྟེན་ན་ཕུལ་ཡིན་ནོ།
en: we are the best in this world,

source: བདག་ཅག་ནི་འཇིག་རྟེན་ན་མཆོག་ཡིན་ནོ་
en: we are supreme in this world.’

source: གལ་ཏེ་དེ་དག་གིས་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དག་མཐོང་ན།
en: When they see followers of the Hearers’ Vehicle

source: དེ་དག་ལ་མ་དད་པ་སྐྱེད་ཅིང་སྨོད་པ་དང་། འཕྱ་བ་དང་། བསྔགས་པ་མ་ཡིན་པ་རྗོད་པར་བྱེད་དེ། །
en: they give rise to disrespect, disparage them, denigrate them, and speak ill of them.

source: བསམ་པ་ངན་པ་དང་། ཉེས་པར་བརྗོད་པ་དེས་ན་ངན་འགྲོར་འགྲོ་བ་ཐོབ་པར་འགྱུར་རོ། །
en: Due to these evil thoughts and condemnations they will be reborn in the lower realms.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Youthful Mañjuśrī asked the Bhagavān,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་བསྔགས་པ་བརྗོད་པར་མི་བགྱི་ལགས་སམ།
en: “Bhagavān, are the bodhisattvas not praised because of the Buddha’s teachings?”

source: འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Mañjuśrī, what do you think?”

source: ཅི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་དགའ་བཞིན་དུ་བལྟ་བ་དང་། ཕན་པའི་དངོས་པོའི་རང་བཞིན་བསྐྱེད་པར་མི་བྱའམ།
en: “Do the bodhisattvas not regard all sentient beings affectionately? Do they not naturally give rise to altruism?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་དེ་ལྟ་ལགས་སོ།
en: “Bhagavān, yes, they do,” answered Mañjuśrī.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། ཐེག་པ་ཆེན་པོ་པ་འགའ་ཙམ་ཡང་ཡོངས་སུ་སྤངས་སམ།
en: “Would bodhisattvas forsake even a few sentient beings, whether of the Hearer’s Vehicle, the Solitary Realizers’ Vehicle, or the Mahāyāna?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: “Bhagavān, they would not,” answered Mañjuśrī.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་ལགས་པས་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་འགའ་ཡང་ཡོངས་སུ་མ་བཏང་བ་ལགས་སོ། །
en: “As bodhisattvas regard all sentient beings equally, bodhisattvas would not dismiss even a few sentient beings.”
